; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v6 - type_1 ?v8 - type_3)
 	      (pred_4 ?v4 - object ?v8 - type_3)
	      (pred_1 ?v6 - type_1 ?v3 - type_2)
	      (pred_2 ?v6 - type_1 ?v4 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v6 - type_1 ?v2 ?v1 - type_3)
       :precondition (and  (pred_3 ?v6 ?v2))
       :effect (and  (pred_3 ?v6 ?v1)
		     (not (pred_3 ?v6 ?v2))))

   (:action op_2
       :parameters (?v6 - type_1 ?v7 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v5) (pred_3 ?v6 ?v5) (pred_1 ?v6 ?v3))
       :effect (and (pred_2 ?v6 ?v7 ?v3)
		    (not (pred_4 ?v7 ?v5)) 
		    (not (pred_1 ?v6 ?v3))))

   (:action op_3
       :parameters (?v6 - type_1 ?v7 - object ?v5 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_2 ?v6 ?v7 ?v3) (pred_3 ?v6 ?v5))
       :effect (and (pred_4 ?v7 ?v5)
		    (pred_1 ?v6 ?v3)
		    (not (pred_2 ?v6 ?v7 ?v3)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_13 obj_07 - type_1
obj_05 obj_11 obj_06 obj_08 - type_2
obj_03 obj_04 obj_02 obj_12 - type_3
obj_09 obj_10 obj_01 - object)
(:init
(pred_3 obj_13 obj_02)
(pred_1 obj_13 obj_05)
(pred_1 obj_13 obj_11)
(pred_3 obj_07 obj_04)
(pred_1 obj_07 obj_06)
(pred_1 obj_07 obj_08)
(pred_4 obj_09 obj_03)
(pred_4 obj_10 obj_04)
(pred_4 obj_01 obj_04)
)
(:goal
(and
(pred_4 obj_09 obj_12)
(pred_4 obj_10 obj_02)
(pred_4 obj_01 obj_12)
)
)

(:constraints
  (always (not (pred_3 obj_13 obj_12)))
)
)

; plan
1. (op_1 obj_13 obj_02 obj_03)
   deleted: (pred_3 obj_13 obj_02)
   added: (pred_3 obj_13 obj_03)
   goals met: 0 of 3
2. (op_2 obj_07 obj_01 obj_04 obj_08)
   deleted: (pred_4 obj_01 obj_04) (pred_1 obj_07 obj_08)
   added: (pred_2 obj_07 obj_01 obj_08)
   goals met: 0 of 3
3. (op_2 obj_07 obj_10 obj_04 obj_06)
   deleted: (pred_4 obj_10 obj_04) (pred_1 obj_07 obj_06)
   added: (pred_2 obj_07 obj_10 obj_06)
   goals met: 0 of 3
4. (op_1 obj_07 obj_04 obj_12)
   deleted: (pred_3 obj_07 obj_04)
   added: (pred_3 obj_07 obj_12)
   goals met: 0 of 3
5. (op_2 obj_13 obj_09 obj_03 obj_11)
   deleted: (pred_4 obj_09 obj_03) (pred_1 obj_13 obj_11)
   added: (pred_2 obj_13 obj_09 obj_11)
   goals met: 0 of 3
6. (op_3 obj_07 obj_01 obj_12 obj_08)
   deleted: (pred_2 obj_07 obj_01 obj_08)
   added: (pred_4 obj_01 obj_12) (pred_1 obj_07 obj_08)
   goals met: 1 of 3
7. (op_1 obj_13 obj_03 obj_02)
   deleted: (pred_3 obj_13 obj_03)
   added: (pred_3 obj_13 obj_02)
   goals met: 1 of 3
8. (op_1 obj_07 obj_12 obj_02)
   deleted: (pred_3 obj_07 obj_12)
   added: (pred_3 obj_07 obj_02)
   goals met: 1 of 3
9. (op_3 obj_13 obj_09 obj_02 obj_11)
   deleted: (pred_2 obj_13 obj_09 obj_11)
   added: (pred_4 obj_09 obj_02) (pred_1 obj_13 obj_11)
   goals met: 1 of 3
10. (op_3 obj_07 obj_10 obj_02 obj_06)
   deleted: (pred_2 obj_07 obj_10 obj_06)
   added: (pred_4 obj_10 obj_02) (pred_1 obj_07 obj_06)
   goals met: 2 of 3
11. (op_2 obj_07 obj_09 obj_02 obj_08)
   deleted: (pred_4 obj_09 obj_02) (pred_1 obj_07 obj_08)
   added: (pred_2 obj_07 obj_09 obj_08)
   goals met: 2 of 3
12. (op_1 obj_07 obj_02 obj_12)
   deleted: (pred_3 obj_07 obj_02)
   added: (pred_3 obj_07 obj_12)
   goals met: 2 of 3
13. (op_3 obj_07 obj_09 obj_12 obj_08)
   deleted: (pred_2 obj_07 obj_09 obj_08)
   added: (pred_4 obj_09 obj_12) (pred_1 obj_07 obj_08)
   goals met: 3 of 3
